Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33e/h/p33EP256GM310.h
#define _RPINR14_QEB1R0_POSITION                 0x00000008
#define _RPINR14_QEB1R0_MASK                     0x00000100
#define _RPINR14_QEB1R0_LENGTH                   0x00000001

#define _RPINR14_QEB1R1_POSITION                 0x00000009
#define _RPINR14_QEB1R1_MASK                     0x00000200
#define _RPINR14_QEB1R1_LENGTH                   0x00000001

#define _RPINR14_QEB1R2_POSITION                 0x0000000A
#define _RPINR14_QEB1R2_MASK                     0x00000400
#define _RPINR14_QEB1R2_LENGTH                   0x00000001

#define _RPINR14_QEB1R3_POSITION                 0x0000000B
#define _RPINR14_QEB1R3_MASK                     0x00000800
#define _RPINR14_QEB1R3_LENGTH                   0x00000001

#define _RPINR14_QEB1R4_POSITION                 0x0000000C
#define _RPINR14_QEB1R4_MASK                     0x00001000
#define _RPINR14_QEB1R4_LENGTH                   0x00000001

#define _RPINR14_QEB1R5_POSITION                 0x0000000D
#define _RPINR14_QEB1R5_MASK                     0x00002000
#define _RPINR14_QEB1R5_LENGTH                   0x00000001

#define _RPINR14_QEB1R6_POSITION                 0x0000000E
#define _RPINR14_QEB1R6_MASK                     0x00004000
#define _RPINR14_QEB1R6_LENGTH                   0x00000001

#define _RPINR15_INDX1R_POSITION                 0x00000000
#define _RPINR15_INDX1R_MASK                     0x0000007F
#define _RPINR15_INDX1R_LENGTH                   0x00000007

#define _RPINR15_HOME1R_POSITION                 0x00000008
#define _RPINR15_HOME1R_MASK                     0x00007F00
#define _RPINR15_HOME1R_LENGTH                   0x00000007

#define _RPINR15_INDX1R0_POSITION                0x00000000
#define _RPINR15_INDX1R0_MASK                    0x00000001
#define _RPINR15_INDX1R0_LENGTH                  0x00000001

#define _RPINR15_INDX1R1_POSITION                0x00000001
#define _RPINR15_INDX1R1_MASK                    0x00000002
#define _RPINR15_INDX1R1_LENGTH                  0x00000001

#define _RPINR15_INDX1R2_POSITION                0x00000002
#define _RPINR15_INDX1R2_MASK                    0x00000004
#define _RPINR15_INDX1R2_LENGTH                  0x00000001

#define _RPINR15_INDX1R3_POSITION                0x00000003
#define _RPINR15_INDX1R3_MASK                    0x00000008
#define _RPINR15_INDX1R3_LENGTH                  0x00000001

#define _RPINR15_INDX1R4_POSITION                0x00000004
#define _RPINR15_INDX1R4_MASK                    0x00000010
#define _RPINR15_INDX1R4_LENGTH                  0x00000001

#define _RPINR15_INDX1R5_POSITION                0x00000005
#define _RPINR15_INDX1R5_MASK                    0x00000020
#define _RPINR15_INDX1R5_LENGTH                  0x00000001

#define _RPINR15_INDX1R6_POSITION                0x00000006
#define _RPINR15_INDX1R6_MASK                    0x00000040
#define _RPINR15_INDX1R6_LENGTH                  0x00000001

#define _RPINR15_HOME1R0_POSITION                0x00000008
#define _RPINR15_HOME1R0_MASK                    0x00000100
#define _RPINR15_HOME1R0_LENGTH                  0x00000001

#define _RPINR15_HOME1R1_POSITION                0x00000009
#define _RPINR15_HOME1R1_MASK                    0x00000200
#define _RPINR15_HOME1R1_LENGTH                  0x00000001

#define _RPINR15_HOME1R2_POSITION                0x0000000A
#define _RPINR15_HOME1R2_MASK                    0x00000400
#define _RPINR15_HOME1R2_LENGTH                  0x00000001

#define _RPINR15_HOME1R3_POSITION                0x0000000B
#define _RPINR15_HOME1R3_MASK                    0x00000800
#define _RPINR15_HOME1R3_LENGTH                  0x00000001

#define _RPINR15_HOME1R4_POSITION                0x0000000C
#define _RPINR15_HOME1R4_MASK                    0x00001000
#define _RPINR15_HOME1R4_LENGTH                  0x00000001

#define _RPINR15_HOME1R5_POSITION                0x0000000D
#define _RPINR15_HOME1R5_MASK                    0x00002000
#define _RPINR15_HOME1R5_LENGTH                  0x00000001

#define _RPINR15_HOME1R6_POSITION                0x0000000E
#define _RPINR15_HOME1R6_MASK                    0x00004000
#define _RPINR15_HOME1R6_LENGTH                  0x00000001

#define _RPINR16_QEA2R_POSITION                  0x00000000
#define _RPINR16_QEA2R_MASK                      0x0000007F
#define _RPINR16_QEA2R_LENGTH                    0x00000007

#define _RPINR16_QEB2R_POSITION                  0x00000008
#define _RPINR16_QEB2R_MASK                      0x00007F00
#define _RPINR16_QEB2R_LENGTH                    0x00000007

#define _RPINR16_QEA2R0_POSITION                 0x00000000
#define _RPINR16_QEA2R0_MASK                     0x00000001
#define _RPINR16_QEA2R0_LENGTH                   0x00000001

#define _RPINR16_QEA2R1_POSITION                 0x00000001
#define _RPINR16_QEA2R1_MASK                     0x00000002
#define _RPINR16_QEA2R1_LENGTH                   0x00000001

#define _RPINR16_QEA2R2_POSITION                 0x00000002
#define _RPINR16_QEA2R2_MASK                     0x00000004
#define _RPINR16_QEA2R2_LENGTH                   0x00000001

#define _RPINR16_QEA2R3_POSITION                 0x00000003
#define _RPINR16_QEA2R3_MASK                     0x00000008
#define _RPINR16_QEA2R3_LENGTH                   0x00000001

#define _RPINR16_QEA2R4_POSITION                 0x00000004
#define _RPINR16_QEA2R4_MASK                     0x00000010
#define _RPINR16_QEA2R4_LENGTH                   0x00000001

#define _RPINR16_QEA2R5_POSITION                 0x00000005
#define _RPINR16_QEA2R5_MASK                     0x00000020
#define _RPINR16_QEA2R5_LENGTH                   0x00000001

#define _RPINR16_QEA2R6_POSITION                 0x00000006
#define _RPINR16_QEA2R6_MASK                     0x00000040
#define _RPINR16_QEA2R6_LENGTH                   0x00000001

#define _RPINR16_QEB2R0_POSITION                 0x00000008
#define _RPINR16_QEB2R0_MASK                     0x00000100
#define _RPINR16_QEB2R0_LENGTH                   0x00000001

#define _RPINR16_QEB2R1_POSITION                 0x00000009
#define _RPINR16_QEB2R1_MASK                     0x00000200
#define _RPINR16_QEB2R1_LENGTH                   0x00000001

